{
  "welcomeTitle": "Let's build something\namazing together",
  "welcomeSubtitle": "Logically minded // Creative at heart",
  "name": "Andrew Polk",
  "photo": "me_3.jpg",
  "title": "Computer Engineer",
  "bio": "Mission-driven full stack developer with a passion for thoughtful UI design, learning, and collaboration.",
  "summary": "Growing up I was always looking for new things to take apart and put back together. Building, Creating and learning have been passions of mine since long before I knew I wanted to be a computer engineer. I have always sought out opportunities and challenges that are meaningful to me. Although my goals have taken many twists and turns — from interests in electrical engineering to robotics, machine learning and even security/cryptography — I have never stopped engaging my passion to help others and solve problems.\n\nAs a full stack web developer, I enjoy using my strong attention to detail, my unequivocal love for making things, and my passion for problem solving to take on any challenge that comes my way. That's why I am excited to make a big impact wherever I work.",
  "currentFocus": "Angular // .NET // UI // AWS",
  "resume": "Resume - Andrew Polk.pdf",
  "experience": [
    {
      "logo": "cubic.png",
      "company": "Cubic Transportation Systems",
      "title": "Full-Stack Software Developer",
      "summary": "Developed customer facing frontend and backend software",
      "items": [
        {
          "type": "list",
          "title": "Trafficware",
          "items": [
            "Led a team in developing traffic management software, focusing on traffic intersections and real-time monitoring",
            "Collaborated with the design team to enhance user experience, implementing streamlined and user-friendly designs",
            "Utilized Angular to enable seamless user data entry, real-time traffic light display, and integration with AWS services (Lambda, DynamoDB, S3, Kinesis)",
            "Integrated overlay information on maps, providing comprehensive views for traffic engineers",
            "Designed and implemented complex chart rendering in Angular for data analysis by traffic engineers",
            "Conducted code reviews, ensuring adherence to coding standards and fostering a collaborative development environment",
            "Identified and addressed performance bottlenecks, enhancing software responsiveness"
          ]
        }
      ],
      "dates": "February 2023 - Present",
      "location": "San Francisco, CA"
    },
    {
      "logo": "tecolote.png",
      "company": "Tecolote Research",
      "title": "Full-Stack Software Developer",
      "summary": "Developed company intranet, websites and ERP systems",
      "items": [
        {
          "type": "list",
          "title": "IT Software",
          "items": [
            "Gained hands-on experience with Angular, .Net Framework, SQL, Version Control",
            "Led restructuring of dozens of enterprise workflows for Angular and .Net Framework",
            "Designed and implemented components, systems and features based on user requirements and business demands",
            "Revamped an existing desktop application into a web-based application",
            "Wrote code, tested, deployed, and maintained software for desktop and mobile devices",
            "Available to users for technical support and to quickly fix issues with minimal down time",
            "Feature owner responsible for entire lifecycles of workflows and applications"
          ]
        }
      ],
      "dates": "May 2019 - February 2023",
      "location": "Santa Barbara, CA"
    },
    {
      "logo": "nps.jpg",
      "company": "Monterey Naval Postgraduate School",
      "title": "Research Intern",
      "summary": "Provided research assistance in the field of big data and machine learning",
      "items": [
        {
          "type": "list",
          "title": "Information Sciences Department",
          "items": [
            "Gained knowledge in data visualization and manipulation working with large data sets",
            "Used neural networks and visualizations to provide insight into possible cyber attacks",
            "Corresponded with high-ranking researchers on datasets ranging from education and networking attacks to military aircraft flight patterns",
            "Collaborated on multiple scientific papers related to big data and deep models applied to cyber security data analysis"
          ]
        }
      ],
      "dates": "June 2018 - August 2018",
      "location": "Monterey, CA"
    }
  ],
  "skills": [
    {
      "title": "LANGUAGES",
      "items": [
        {
          "text": "Typescript",
          "logo": "typescript.png"
        },
        {
          "text": "C#",
          "logo": "csharp.png"
        },
        {
          "text": "Python",
          "logo": "python.png"
        },
        {
          "text": "SQL",
          "logo": "sql.png"
        }
      ]
    },
    {
      "title": "FRAMEWORKS & TOOLS",
      "items": [
        {
          "text": "Angular",
          "logo": "angular.png"
        },
        {
          "text": "AWS Lambda",
          "logo": "OIP.jpg"
        },
        {
          "text": "Javascript",
          "logo": "javascript.png"
        },
        {
          "text": "Sass",
          "logo": "sass.png"
        }
      ]
    },
    {
      "title": "OTHER",
      "items": [
        {
          "text": "Lightroom",
          "logo": "lightroom.png"
        },
        {
          "text": "Photoshop",
          "logo": "photoshop.png"
        },
        {
          "text": "Unity3D",
          "logo": "unity3d.png"
        }
      ]
    }
  ],
  "education": [
    {
      "school": "University Of California, Santa Barbara",
      "location": "Santa Barbara, CA",
      "bullets": ["B.S. Computer Engineering"]
    }
  ]
}
